Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sgpio.h
/**************************************************************************//**
 * @file     rtl8195bh_sgpio.h
 * @brief    The HAL related definition and macros for the SGPIO device.
 *           Includes Registers and data type definition.
 * @version  V1.00
 * @date     2016-07-20
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef _RTL8195BHP_SGPIO_H_
#define _RTL8195BHP_SGPIO_H_

/**
 * @addtogroup hs_hal_sgpio SGPIO
 * @{
 */

#include "basic_types.h"
#include "rtl8735b_sgpio_type.h"


#define REG_PERI_MULFDATA   0x074

#define SGPIO_HP_SCLK_NS    12.5f // ASIC: 12.5f, FPGA: 50.0f

/**
  \brief  Define the SGPIO port ID.
*/
enum  sgpio_index_sel_e {
	Sgpio0_Sel    =   0x0,
	Sgpio1_Sel    =   0x1,
	Sgpio2_Sel    =   0x2,
	Sgpio_Max_Id  =   0x3
};
typedef uint8_t sgpio_index_sel_t;

/**
  \brief Define the input methold to start rx timer counter.
*/
enum  sgpio_rxtc_input_start_e {
	Rxtc_None           = 0,
	Rxtc_InputRiseEg    = 1,
	Rxtc_InputFallEg    = 2,
	Rxtc_InputBothEg    = 3
};
typedef uint8_t sgpio_rxtc_input_start_t;

/**
  \brief Define the rxtc match event ID.
*/
enum  sgpio_rxtc_match_event_e {
	Rxtc_MatchEvent0   = 0,
	Rxtc_MatchEvent1   = 1,
	Rxtc_MatchEvent2   = 2,
};
typedef uint8_t sgpio_rxtc_match_event_t;

/**
  \brief Define the methold to work the capture.
*/
enum  sgpio_capture_type_e {
	Cap_None                = 0,
	Cap_InputRiseEg         = 1,
	Cap_InputFallEg         = 2,
	Cap_InputBothEg         = 3,
	Cap_MultcMatchEvent0    = 4
};
typedef uint8_t sgpio_capture_type_t;

/**
  \brief Define multc is timer or counter mode
*/
enum  sgpio_multc_mode_e {
	Multc_Timer_Mode            = 0,
	Multc_Counter_InputRiseEg   = 1,
	Multc_Counter_InputFallEg   = 2,
	Multc_Counter_InputBothEg   = 3
};
typedef uint8_t sgpio_multc_mode_t;

/**
  \brief Define the input methold to count.
*/
enum  sgpio_counter_edge_e {
	Input_None       = 0,
	Input_RiseEdge   = 1,
	Input_FallEdge   = 2,
	Input_BothEdge   = 3
};
typedef uint8_t sgpio_counter_edge_t;


/**
  \brief Define the multc match event ID.
*/
enum  sgpio_multc_match_event_e {
	Multc_MatchEvent0   = 0,
	Multc_MatchEvent1   = 1,
	Multc_MatchEvent2   = 2,
	Multc_MatchEvent3   = 3
};
typedef uint8_t sgpio_multc_match_event_t;

/**
  \brief Define the multc group ID.
*/
enum  sgpio_multc_match_group_e {
	Multc_MatchGroup0   = 0,
	Multc_MatchGroup1   = 1
};
typedef uint8_t sgpio_multc_match_group_t;

/**
  \brief Define the output state when happen the match event.
*/
enum  sgpio_external_output_e {
	External_None   = 0,
	External_Low    = 1,
	External_High   = 2,
	External_Toggle = 3
};
typedef uint8_t sgpio_external_output_t;

/**
  \brief Define the rx is only input or in-out.
*/
enum  sgpio_rx_inoutput_e {
	Rx_Input_Only   = 0,
	Rx_In_And_Output = 1
};
typedef uint8_t sgpio_rx_inoutput_t;

/**
  \brief Define the output is low or high.
*/
enum  sgpio_output_value_e {
	Output_Is_Low   = 0,
	Output_Is_High  = 1
};
typedef uint8_t sgpio_output_value_t;

/**
  \brief Define the data is MSB or LSB.
*/
enum  sgpio_first_msb_or_lsb_e {
	First_Data_LSB = 0,
	First_Data_MSB = 1
};
typedef uint8_t sgpio_first_msb_or_lsb_t;

/**
  \brief Define the compare result is 0 or 1 when the capture value is bigger than the compare value.
*/
enum  sgpio_cmp_result_bit_e {
	Compare_Result_Bit0 = 0,
	Compare_Result_Bit1 = 1
};
typedef uint8_t sgpio_cmp_result_bit_t;

/**
  \brief Define the time unit.
*/
enum  sgpio_time_unit_e {
	Time_unit_us = 0,
	Time_unit_ns = 1
};
typedef uint8_t sgpio_time_unit_t;

/**
  \brief Define the time source and unit.
*/
enum  sgpio_unit_e {
	Timer_mode_unit_us = 0,
	Timer_mode_unit_ns = 1,
	Countr_mode_unit_cnt = 2
};
typedef uint8_t sgpio_source_unit_t;

/**
  \brief Define sgpio irq bit shift.
*/
enum  sgpio_irq_shift_e {
	Rx_Mr0_Sft          = 0,
	Rx_Mr1_Sft          = 1,
	Rx_Mr2_Sft          = 2,
	Mul_Mr0_Sft         = 3,
	Cap_Sft             = 4,
	Rxsft_Sft           = 5,
	Mulsft_Sft          = 6,
	Rxload_Sft          = 7,
	Mulload_Sft         = 8,
	Pattern_Match_Sft   = 9,
	Mulmcnt_Sft         = 10,
	Mul_Dma_Unfl_Sft    = 11,
	Max_Sgpio_Sft       = 12
};
typedef uint8_t sgpio_irq_shift_t;

/**
  \brief  SGPIO call back function for the interrupt event.
*/
typedef void (*sgpio_irq_user_cb_t)(void *);

/**
  \brief Define the rx timer counter event.
*/
typedef struct hal_sgpio_rxtc_event_s {
	u32 rxtc_match_event0   : 1;        /*!< This event is that the rx timer value matches rx match register 0. */
	u32 rxtc_match_event1   : 1;        /*!< This event is that the rx timer value matches rx match register 1. */
	u32 rxtc_match_event2   : 1;        /*!< This event is that the rx timer value matches rx match register 2. */
	u32 multc_match_event0  : 1;        /*!< This event is that the multc timer value matches Multiple Match Register 0. */
	u32 rx_postc_zero       : 1;        /*!< This event is that the rxpostc register becomes 0. */
	u32 capture_event       : 1;        /*!< This event is that happen the capture.  */
} hal_sgpio_rxtc_event_t, *phal_sgpio_event_t;

/**
  \brief Define the multi timer counter event.
*/
typedef struct hal_sgpio_multc_event_s {
	u32 multc_match_event0  : 1;        /*!< This event is that the multc timer value matches multiple match register 0. */
	u32 rxtc_match_event0   : 1;        /*!< This event is that the rx timer value matches rx match register 0. */
	u32 multc_mcnt_zero     : 1;        /*!< This event is that the mul_mcnt register becomes 0. */
} hal_sgpio_multc_event_t, *phal_sgpio_multc_event_t;

/**
  \brief Define the rx sampling event.
*/
typedef struct hal_sgpio_sampling_event_s {
	u32 rxtc_match_event0  : 1;     /*!< This event is that the rx timer value matches rx match register 0. */
	u32 rxtc_match_event1  : 1;     /*!< This event is that the rx timer value matches rx match register 1. */
	u32 rxtc_match_event2  : 1;     /*!< This event is that the rx timer value matches rx match register 2. */
} hal_sgpio_sampling_event_t, *phal_sgpio_sampling_event_t;

/**
  \brief Define the data structure for the multc FIFO mode.
*/
typedef struct hal_sgpio_fifo_value_s {
	u16 multc_match_event0_val;     /*!< The multc match register 0. */
	u16 multc_match_event1_val;     /*!< The multc match register 1. */
	u16 multc_match_event2_val;     /*!< The multc match register 2. */
	u16 multc_match_event3_val;     /*!< The multc match register 3. */
} hal_sgpio_fifo_value_t, *phal_sgpio_fifo_value_t;

/**
  \brief The parameter structure for initializing the interrupt event.
*/
typedef struct hal_sgpio_set_irq_s {
	BOOL int_en;                    /*!< 0: disbale this event interrupt, 1: enable. */
	BOOL imr_en;                    /*!< 0: disbale mask event interrupt, 1: enable.  */
	BOOL callback_reg_en;           /*!< 0: don't register this callback function, 1: register this callback function. */
	sgpio_irq_user_cb_t callback;   /*!< The callback function. */
	void *arg;                      /*!< The callback argument. */
} hal_sgpio_set_irq_t, *phal_sgpio_set_irq_t;

/**
  \brief Record the rx processing information.
*/
typedef struct hal_sgpio_rx_info_s {
	sgpio_first_msb_or_lsb_t first_data_flag; /*!< Record to use MSB or LSB. */
	u8 rx_bit_length_copy;                    /*!< Record the bit length generated the interrupt. Value: 1 ~ 32, 0: do nothing. */
} hal_sgpio_rx_info_t, *phal_sgpio_rx_info_t;

/**
  \brief Record the tx processing information.
*/
typedef struct hal_sgpio_tx_info_s {
	u32 *ptxdata_pointer_copy;      /*!< The txdata pointer. */
	u16 bit_length_copy;            /*!< The output bit number.  */
	u16 output_bit_counts_copy;     /*!< Copy the output bit number.  */
	u16 bit_counts_quot_irq_source; /*!< Record the processing information.  */
	u16 bit_counts_quot_irq;        /*!< Record the processing information.  */
	u32 *ptxdata_pointer_irq;       /*!< Record the processing information.  */
} hal_sgpio_tx_info_t, *phal_sgpio_tx_info_t;

/**
  \brief Record the dma processing information.
*/
typedef struct hal_sgpio_dma_info_s {
	u8  match_reset_counter_copy;           /*!< Record the processing information.  */
	sgpio_irq_user_cb_t irq_user_dma_cb;    /*!< The dma callback function. */
	void *user_dma_arg;                     /*!< The dma callback argument. */
} hal_sgpio_dma_info_t, *phal_sgpio_dma_info_t;

