Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sgpio.h
typedef struct hal_sgpio_adapter_s {
	sgpio_index_sel_t sgpio_index;              /*!< The SGPIO port ID. */
	SGPIO_Type *base_addr;                     /*!< The SGPIO common register base address */
	float sgpio_sclk_ns;                        /*!< Record SGPIO sclk */
	u16 *pmemory_addr;                          /*!< Record the tx memory address */
	hal_sgpio_rx_info_t sgpio_rx_info;          /*!< Record the rx processing information.   */
	hal_sgpio_tx_info_t sgpio_tx_info;          /*!< Record the tx processing information.   */
	hal_sgpio_dma_info_t sgpio_dma_info;        /*!< Record the dma processing information.   */
	hal_gdma_adaptor_t *phal_gdma_adaptor;      /*!< The GDMA adapter. */
	sgpio_irq_user_cb_t irq_user_cb[12];        /*!< The SGPIO call back function for the interrupt event */
	void *user_arg[12];                         /*!< The argument of call back function */

	u8 dcache_memory_en;                        /*!< Check the memory is cache or not  */

	void (*dcache_clean_by_addr)(uint32_t *addr, int32_t dsize);    /*!< Callback function to do the D-cache clean  */
} hal_sgpio_adapter_t, *phal_sgpio_adapter_t;

/**
  \brief  The data structure to handle multiple SGPIO adapters.
*/
typedef struct hal_sgpio_group_adapter_s {
	volatile uint32_t critical_lv;                      /*!< to record SGPIO HAL enter critical section level */
	hal_sgpio_adapter_t *psgpio_adapter[Sgpio_Max_Id];  /*!< All the SGPIO adapters of this platform */
	irq_handler_t   irq_fun[Sgpio_Max_Id];              /*!< the IRQ handler for different SGPIO adapters */
} hal_sgpio_group_adapter_t, *phal_sgpio_group_adapter_t;

//====== Normal Function Parameter======

/**
  \brief  The parameter structure of the rxtc timer mode.
*/
typedef struct hal_sgpio_rxtc_timer_mode_s {
	BOOL timer_once_en;                     /*!< Enable that matching event is executed once. */
	sgpio_time_unit_t time_unit;            /*!< Select the time unit. */
	u32 match_value1_time;                  /*!< Matching this time 1 generates the interrupt. */
	sgpio_irq_user_cb_t match_value1_cb;    /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *pmatch_value1_arg;                /*!< User defined IRQ callback parameter.  */
	u32 match_value2_time;                  /*!< Matching this time 2 generates the interrupt. */
	sgpio_irq_user_cb_t match_value2_cb;    /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *pmatch_value2_arg;                /*!< User defined IRQ callback parameter.  */
	u32 match_reset_value_time;             /*!< This match time is able to make the timer reset and stop. */
	sgpio_irq_user_cb_t reset_value_cb;     /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *preset_value_arg;                 /*!< User defined IRQ callback parameter. */
} hal_sgpio_rxtc_timer_mode_t, *phal_sgpio_rxtc_timer_mode_t;

/**
  \brief  The parameter structure of the multc timer mode.
*/
typedef struct hal_sgpio_multc_timer_mode_s {
	BOOL timer_once_en;                     /*!< Enable that matching event is executed once. */
	sgpio_time_unit_t time_unit;            /*!< Select the time unit. */
	u32 match_reset_value_time;             /*!< This match time is able to make the timer reset and stop. */
	sgpio_irq_user_cb_t reset_value_cb;     /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *preset_value_arg;                 /*!< User defined IRQ callback parameter. */
} hal_sgpio_multc_timer_mode_t, *phal_sgpio_multc_timer_mode_t;

/**
  \brief  The parameter structure of the multc counter mode.
*/
typedef struct hal_sgpio_multc_counter_mode_s {
	BOOL counter_en;                        /*!< To enable or disable. */
	sgpio_counter_edge_t input_edge;        /*!< Select the edge of the trigger event. */
	u16 match_counter_value;                /*!< When the counter value is equal to match_value, generate an interrupt. */
	BOOL match_counter_reset_en;            /*!< When the counter value is equal to match_value, reset the counter. */
	BOOL match_counter_disable_en;          /*!< When the counter value is equal to match_value, make counter_en become disable(0).  */
	sgpio_time_unit_t time_unit;            /*!< Select the time unit. */
	u32 counter_reset_timeout_value;        /*!< Set the monitor period. */
	sgpio_irq_user_cb_t match_counter_cb;   /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *pmatch_counter_arg;               /*!< User defined IRQ callback parameter. */
} hal_sgpio_multc_counter_mode_t, *phal_sgpio_multc_counter_mode_t;

/**
  \brief  The parameter structure of the rxtc external output.
*/
typedef struct hal_sgpio_rxtc_timer_match_output_s {
	sgpio_external_output_t match_value1_output;        /*!< Set the output value when match the time 1. */
	sgpio_external_output_t match_value2_output;        /*!< Set the output value when match the time 2. */
	sgpio_external_output_t match_reset_value_output;   /*!< Set the output value when match the reset time. */
} hal_sgpio_rxtc_timer_match_output_t, *phal_sgpio_rxtc_timer_match_output_t;

/**
  \brief  The parameter structure of the multc external output.
*/
typedef struct hal_sgpio_multc_timer_counter_match_output_s {
	sgpio_source_unit_t source_unit;                /*!< Select the time unit.   */
	sgpio_external_output_t match_value1_output;    /*!< Set the output value when happen the multc match event 1.  */
	u32 match_value1;                               /*!< The match value 1 of the multc timer counter.  */
	sgpio_external_output_t match_value2_output;    /*!< Set the output value when happen the multc match event 2.  */
	u32 match_value2;                               /*!< The match value 2 of the multc timer counter.  */
	sgpio_external_output_t match_value3_output;    /*!< Set the output value when happen the multc match event 3.  */
	u32 match_value3;                               /*!< The match value 3 of the multc timer counter.  */
} hal_sgpio_multc_timer_counter_match_output_t, *phal_sgpio_multc_timer_counter_match_output_t;

/**
  \brief  The parameter structure of the rxtc capture mode.
*/
typedef struct hal_sgpio_rxtc_capture_mode_s {
	BOOL capture_en;                            /*!< To enable or disable. */
	sgpio_rxtc_input_start_t start_timer_edge;  /*!< Select the trigger edge for starting the rxtc timer. */
	sgpio_capture_type_t input_capture_edge;    /*!< Select the capture edge for capturing the time. */
	BOOL capture_timer_reset_en;                /*!< When happen the capture event, reset the rxtc timer. */
	BOOL capture_timer_disable_en;              /*!< When happen the capture event, stop the rxtc timer. */
	u32 max_capture_range_us;                   /*!< Set the maximum possible measurement value for making the prescale of the timer automatically. */
	sgpio_irq_user_cb_t capture_cb;             /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *pcapture_arg;                         /*!< User defined IRQ callback parameter. */
} hal_sgpio_rxtc_capture_mode_t, *phal_sgpio_rxtc_capture_mode_t;

/**
  \brief  The parameter structure of the rxtc capture timeout.
*/
typedef struct hal_sgpio_rxtc_capture_timeout_s {
	BOOL capture_timeout_en;                    /*!< To enable or disable. */
	BOOL capture_timer_reset_en;                /*!< Reset the capture timer when the timer value is equal to timeout_value. */
	BOOL capture_timer_disable_en;              /*!< Stop the capture timer when the timer value is equal to timeout_value. */
	sgpio_time_unit_t time_unit;                /*!< Select the time unit. */
	u32 timeout_value;                          /*!< Matching this timeout value generates the interrupt. */
	sgpio_irq_user_cb_t capture_timeout_cb;     /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *pcapture_timeout_arg;                 /*!< User defined IRQ callback parameter.  */
} hal_sgpio_rxtc_capture_timeout_t, *phal_sgpio_rxtc_capture_timeout_t;

/**
  \brief  The parameter structure of the rxtc capture monitor.
*/
typedef struct hal_sgpio_rxtc_capture_monitor_s {
	BOOL capture_monitor_en;                    /*!< To enable or disable. */
	sgpio_time_unit_t time_unit;                /*!< Select the time unit.  */
	u32 monitor_time;                           /*!< The monitor value. */
	u8 monitor_count;                           /*!< Set the continuous numbers of the successful condition. Value: 1 ~ 32, 0: do nothing. */
	sgpio_irq_user_cb_t capture_monitor_cb;     /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *pcapture_monitor_arg;                 /*!< User defined IRQ callback parameter.  */
} hal_sgpio_rxtc_capture_monitor_t, *phal_sgpio_rxtc_capture_monitor_t;

/**
  \brief  The parameter structure of the sampling rxdata.
*/
typedef struct hal_sgpio_sampling_rxdata_s {
	BOOL sampling_en;                           /*!< To enable or disable. */
	sgpio_rxtc_input_start_t start_timer_edge;  /*!< Select the trigger edge for starting the rxtc timer. */
	sgpio_time_unit_t time_unit;                /*!< Select the time unit. */
	u32 sampling_time1_time;                    /*!< The sampling time 1 needs less than the sampling end time. Set to 0 when not in use. */
	u32 sampling_time2_time;                    /*!< The sampling time 2 needs less than the sampling end time. Set to 0 when not in use. */
	u32 sampling_time_end_time;                 /*!< The sampling end time. Matching this time is to make the timer reset and stop. */
	u8 sampling_bit_length;                     /*!< Set the bit length generated the interrupt. Value: 1 ~ 32, 0: do nothing. */
	sgpio_first_msb_or_lsb_t first_msb_or_lsb;  /*!< Putting in the register is LSB or MSB. */
	sgpio_irq_user_cb_t sampling_finish_cb;     /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *psampling_finish_arg;                 /*!< User defined IRQ callback parameter. */
} hal_sgpio_sampling_rxdata_t, *phal_sgpio_sampling_rxdata_t;

/**
  \brief  The parameter structure of the capture compare rxdata.
*/
typedef struct hal_sgpio_capture_compare_rxdata_s {
	BOOL capture_en;                            /*!< To enable or disable. */
	sgpio_rxtc_input_start_t start_timer_edge;  /*!< Select the trigger edge for starting the rxtc timer.   */
	sgpio_capture_type_t input_capture_edge;    /*!< Select the capture edge for capturing the time. */
	u32 max_capture_range_us;                   /*!< Set the maximum possible measurement value for making the prescale of the timer automatically.  */
	sgpio_time_unit_t time_unit;                /*!< Select the time unit. */
	u32 capture_compare_value_time;             /*!< Set the compare time. */
	sgpio_cmp_result_bit_t compare_result_bit;  /*!< Deciding the value of the result bit is "0" or "1".  */
	u8 compare_bit_length;                      /*!< Set the bit length generated the interrupt. Value: 1 ~ 32, 0: do nothing.   */
	sgpio_first_msb_or_lsb_t first_msb_or_lsb;  /*!< Putting in the register is LSB or MSB. */
	sgpio_irq_user_cb_t compare_finish_cb;      /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *pcompare_finish_arg;                  /*!< User defined IRQ callback parameter.  */
} hal_sgpio_capture_compare_rxdata_t, *phal_sgpio_capture_compare_rxdata_t;

/**
  \brief  The parameter structure of the txdata bit symbol.
*/
typedef struct hal_sgpio_txdata_bit_symbol_s {
	sgpio_output_value_t initial_output_value;  /*!< Set the initial output value. */
	sgpio_time_unit_t time_unit;                /*!< Select the time unit. */
	u32 bit0_middle_change_time;                /*!< The time is to change the output value for the bit 0. */
	u32 bit0_duration_time;                     /*!< The duration of the bit 0. */
	u32 bit1_middle_change_time;                /*!< The time is to change the output value for the bit 1. */
	u32 bit1_duration_time;                     /*!< The duration of the bit 1. */
} hal_sgpio_txdata_bit_symbol_t, *phal_sgpio_txdata_bit_symbol_t;

/**
  \brief  The parameter structure of the txdata.
*/
typedef struct hal_sgpio_txdata_s {
	BOOL txdata_en;                         /*!< To enable or disable. */
	BOOL rx_direction_output_en;            /*!< Control the output behavior of the bidirectional Rx. */
	u16 output_bit_counts;                  /*!< Set the output bit number.  */
	u32 *ptxdata_pointer;                   /*!< Set the output data pointer. */
	sgpio_irq_user_cb_t txdata_finish_cb;   /*!< When finish the TX output, generate the interrupt.  */
	void *ptxdata_finish_arg;               /*!< User defined IRQ callback parameter.   */
} hal_sgpio_txdata_t, *phal_sgpio_txdata_t;

/**
  \brief  The parameter structure of the monitor rxdata.
*/
typedef struct hal_sgpio_monitor_rxdata_s {
	BOOL monitor_en;                        /*!< To enable or disable. */
	u32 monitor_data;                       /*!< Set the monitor data. */
	u32 monitor_input_data_mask;            /*!< Set the bit mask of the monitor data. */
	sgpio_irq_user_cb_t monitor_rxdata_cb;  /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *pmonitor_rxdata_arg;              /*!< User defined IRQ callback parameter.  */
} hal_sgpio_monitor_rxdata_t, *phal_sgpio_monitor_rxdata_t;

/**
  \brief  The parameter structure of the dma match output.
*/
typedef struct hal_sgpio_dma_match_output_s {
	sgpio_external_output_t match_value1_output;    /*!< Set the output value when match value 1. */
	sgpio_external_output_t match_value2_output;    /*!< Set the output value when match value 2. */
	sgpio_external_output_t match_value3_output;    /*!< Set the output value when match value 3. */
	u16 *pmatch_value_ptr;                          /*!< The pointer is the memory address of setting the match time. */
	u8  match_reset_counter;                        /*!< Set the number of reset times. An interrupt will be generated when the number of times is reached. */
	sgpio_irq_user_cb_t counter_finish_cb;          /*!< User defined IRQ callback function. Using "NULL" will not generate this interrupt. */
	void *pcounter_finish_arg;                      /*!< User defined IRQ callback parameter. */
} hal_sgpio_dma_match_output_t, *phal_sgpio_dma_match_output_t;

/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hs_hal_sgpio_rom_func SGPIO HAL ROM APIs.
 * @{
 */

void hal_rom_sgpio_irq_handler(void *hid);
void hal_rom_sgpio_irq_reg(void);
void hal_rom_sgpio_unreg(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_reg_cb(hal_sgpio_adapter_t *psgpio_adp, sgpio_irq_user_cb_t callback, void *arg, sgpio_irq_shift_t irq_shift);
void hal_rom_sgpio_unreg_cb(hal_sgpio_adapter_t *psgpio_adp, sgpio_irq_shift_t irq_shift);
HAL_Status hal_rom_sgpio_en_ctrl(sgpio_index_sel_t sgpio_index, BOOL en);
HAL_Status hal_rom_sgpio_init(hal_sgpio_adapter_t *psgpio_adp, sgpio_index_sel_t sgpio_index);
void hal_rom_sgpio_deinit(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_enter_critical(void);
void hal_rom_sgpio_exit_critical(void);
void hal_rom_sgpio_set_rxtc_stop_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_event_t *prxtc_event);
void hal_rom_sgpio_get_rxtc_stop_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_event_t *prxtc_event);
void hal_rom_sgpio_set_rxtc_reset_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_event_t *prxtc_event);
void hal_rom_sgpio_get_rxtc_reset_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_event_t *prxtc_event);
void hal_rom_sgpio_set_rxtc_match_value(hal_sgpio_adapter_t *psgpio_adp, sgpio_rxtc_match_event_t match_event, u16 match_value);
void hal_rom_sgpio_set_rxtc_int(hal_sgpio_adapter_t *psgpio_adp,  sgpio_rxtc_match_event_t match_event, hal_sgpio_set_irq_t *psgpio_set_irq);
void hal_rom_sgpio_set_capture_ctrl(hal_sgpio_adapter_t *psgpio_adp, sgpio_capture_type_t capture_type, BOOL cap_en);
void hal_rom_sgpio_set_capture_compare(hal_sgpio_adapter_t *psgpio_adp, u8 cap_cmpval_sel, u16 cap_cmpval);
void hal_rom_sgpio_set_capture_int(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_set_irq_t *psgpio_set_irq);
void hal_rom_sgpio_set_multc_stop_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_event_t *pmultc_event);
void hal_rom_sgpio_get_multc_stop_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_event_t *pmultc_event);
void hal_rom_sgpio_set_multc_reset_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_event_t *pmultc_event);
void hal_rom_sgpio_get_multc_reset_ctrl(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_event_t *pmultc_event);
void hal_rom_sgpio_set_multc_match_value(hal_sgpio_adapter_t *psgpio_adp, sgpio_multc_match_group_t match_group, sgpio_multc_match_event_t match_event,
		u16 match_value);
void hal_rom_sgpio_set_multc_match_event0_int(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_set_irq_t *psgpio_set_irq);
void hal_rom_sgpio_set_multc_match_group(hal_sgpio_adapter_t *psgpio_adp, sgpio_multc_match_group_t match_group);
void hal_rom_sgpio_set_multc_fifo_value(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_fifo_value_t *pfifo_value);
void hal_rom_sgpio_set_rxtc_external_match(hal_sgpio_adapter_t *psgpio_adp, sgpio_rxtc_match_event_t match_event, sgpio_external_output_t external_output);
void hal_rom_sgpio_set_multc_external_match(hal_sgpio_adapter_t *psgpio_adp, sgpio_multc_match_event_t match_event, sgpio_external_output_t external_output);
void hal_rom_sgpio_set_multc_match_event0_cnt_int(hal_sgpio_adapter_t *psgpio_adp, BOOL match_cnt_en, u8 match_down_cnt, hal_sgpio_set_irq_t *psgpio_set_irq);
void hal_rom_sgpio_set_multc_match_event0_cnt(hal_sgpio_adapter_t *psgpio_adp, BOOL match_cnt_en, u8 match_down_cnt);
void hal_rom_sgpio_init_rxdata_time_sampling(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_sampling_event_t *psampling_event);
void hal_rom_sgpio_deinit_rxdata_time_sampling(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_init_rxdata_capture_compare(hal_sgpio_adapter_t *psgpio_adp, sgpio_cmp_result_bit_t cmp_result_bit, u16 cap_cmpval);
void hal_rom_sgpio_deinit_rxdata_capture_compare(hal_sgpio_adapter_t *psgpio_adp);
HAL_Status hal_rom_sgpio_set_rxdata_load_int(hal_sgpio_adapter_t *psgpio_adp, u8 bit_length, hal_sgpio_set_irq_t *psgpio_set_irq);
void hal_rom_sgpio_set_rxdata_prebuf_bit_shift_int(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_set_irq_t *psgpio_set_irq);
void hal_rom_sgpio_reset_rxdata(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_set_rxdata_match_int(hal_sgpio_adapter_t *psgpio_adp, BOOL rxdata_match_en, u32 match_value, hal_sgpio_set_irq_t *psgpio_set_irq);
HAL_Status hal_rom_sgpio_set_txdata_bit_length_int(hal_sgpio_adapter_t *psgpio_adp, u8 bit_length, hal_sgpio_set_irq_t *psgpio_set_irq);
void hal_rom_sgpio_set_txdata_prebuf_bit_shift_int(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_set_irq_t *psgpio_set_irq);
void hal_rom_sgpio_reset_txdata(hal_sgpio_adapter_t *psgpio_adp);
u32 hal_rom_sgpio_set_time_to_rxtc(hal_sgpio_adapter_t *psgpio_adp, sgpio_time_unit_t time_unit, u32 time_value);
u32 hal_rom_sgpio_set_time_to_multc(hal_sgpio_adapter_t *psgpio_adp, sgpio_time_unit_t time_unit, u32 time_value);
u32 hal_rom_sgpio_set_rxtc_to_time(hal_sgpio_adapter_t *psgpio_adp, u16 rxtc_unit, sgpio_time_unit_t time_unit);
u32 hal_rom_sgpio_set_multc_to_time(hal_sgpio_adapter_t *psgpio_adp, u16 multc_unit, sgpio_time_unit_t time_unit);
void hal_rom_sgpio_clean_status(hal_sgpio_adapter_t *psgpio_adp, u32 sgpio_is);
void hal_rom_sgpio_update_rxtcmr(hal_sgpio_adapter_t *psgpio_adp, sgpio_rxtc_match_event_t match_event, u16 old_prescale);
void hal_rom_sgpio_update_multcmr(hal_sgpio_adapter_t *psgpio_adp, sgpio_multc_match_group_t match_group, sgpio_multc_match_event_t match_event,
								  u16 old_prescale);
void hal_rom_sgpio_rxtc_timer_mode(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_timer_mode_t *psgpio_rxtc_timer_mode);
void hal_rom_sgpio_multc_timer_mode(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_timer_mode_t *psgpio_multc_timer_mode);
void hal_rom_sgpio_multc_counter_mode(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_multc_counter_mode_t *psgpio_multc_counter_mode);
void hal_rom_sgpio_rxtc_timer_match_output(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_timer_match_output_t *psgpio_rxtc_timer_match_output);
void hal_rom_sgpio_multc_timer_counter_match_output(hal_sgpio_adapter_t *psgpio_adp,
		hal_sgpio_multc_timer_counter_match_output_t *psgpio_multc_timer_counter_match_output);
void hal_rom_sgpio_rxtc_capture_mode(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_capture_mode_t *psgpio_rxtc_capture_mode);
void hal_rom_sgpio_rxtc_capture_timeout(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_capture_timeout_t *psgpio_rxtc_capture_timeout);
void hal_rom_sgpio_rxtc_capture_monitor(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_rxtc_capture_monitor_t *psgpio_rxtc_capture_monitor);
u32 hal_rom_sgpio_get_rxtc_capture_time(hal_sgpio_adapter_t *psgpio_adp, sgpio_time_unit_t time_unit);
void hal_rom_sgpio_init_rxdata_capture_compare_time(hal_sgpio_adapter_t *psgpio_adp, sgpio_cmp_result_bit_t cmp_result_bit, sgpio_time_unit_t time_unit,
		u32 cap_cmpval_time);
void hal_rom_sgpio_sampling_rxdata(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_sampling_rxdata_t *psgpio_sampling_data);
u32 hal_rom_sgpio_get_input_rxdata(hal_sgpio_adapter_t *psgpio_adp);
u32 hal_rom_sgpio_get_arrange_rxdata(hal_sgpio_adapter_t *psgpio_adp, u32 rxdata_tp);
void hal_rom_sgpio_capture_compare_rxdata(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_capture_compare_rxdata_t *psgpio_compare_data);
void hal_rom_sgpio_txdata_bit_symbol(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_txdata_bit_symbol_t *psgpio_txdata_bit_symbol);
void hal_rom_sgpio_txdata(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_txdata_t *psgpio_txdata);
void hal_rom_sgpio_txdata_bit_length_irq(void *data);
void hal_rom_sgpio_send_txdata(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_reset_receive_rxdata(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_disable_rxdata_match(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_monitor_rxdata(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_monitor_rxdata_t *pmonitor_rxdata);
void hal_rom_sgpio_multc_fifo_reset(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_dma_match_output_irq_handle(void *data);
HAL_Status hal_rom_sgpio_dma_match_output_init(hal_sgpio_adapter_t *psgpio_adp, hal_gdma_adaptor_t *pgdma_adaptor,
		hal_sgpio_dma_match_output_t *pdma_match_output);
HAL_Status hal_rom_sgpio_dma_match_output_deinit(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_dma_handshake_init(hal_sgpio_adapter_t *psgpio_adp, hal_sgpio_dma_match_output_t *pdma_match_output);
void hal_rom_sgpio_dma_preload_data(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_dma_send_start(hal_sgpio_adapter_t *psgpio_adp);
void hal_rom_sgpio_dma_time_to_multc(hal_sgpio_adapter_t *psgpio_adp, u16 *pmemory_addr, u8 reset_cnt, sgpio_time_unit_t time_unit);

/**
 *  @brief  Rxtc and rxprtc are synchronously reset.
 *
 *  @param[in] psgpio_adp The SGPIO adapter.
 *
 *  @returns void
 */
__STATIC_INLINE
void hal_rom_sgpio_set_rxtc_rst(hal_sgpio_adapter_t *psgpio_adp)
{
	psgpio_adp->base_addr->rxtmr_ctrl_b.rxtmr_crst = 1;
}

/**
 *  @brief  Set the rx timer counter value.
 *
 *  @param[in] psgpio_adp The SGPIO adapter.
 *  @param[in] rxtc_value Rx timer counter value.
 *
 *  @returns void
 */
__STATIC_INLINE
void hal_rom_sgpio_set_rxtc_value(hal_sgpio_adapter_t *psgpio_adp, u16 rxtc_value)
{
	psgpio_adp->base_addr->rxtc_b.rxtc = rxtc_value;
}

/**
 *  @brief  Get the rx timer counter value.
 *
 *  @param[in] psgpio_adp The SGPIO adapter.
 *
 *  @returns Rx timer counter value.
 */
__STATIC_INLINE
u16 hal_rom_sgpio_get_rxtc_value(hal_sgpio_adapter_t *psgpio_adp)
{
	return (psgpio_adp->base_addr->rxtc_b.rxtc);
}

